# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd 
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [2]:
s1=pd.Series(np.random.randint(1,5,size=100,dtype='l'))
s2=pd.Series(np.random.randint(1,4,size=100,dtype='l'))
s3=pd.Series(np.random.randint(10000,30001,size=100,dtype='l'))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [3]:
df=pd.concat([s1,s2,s3],axis=1)
df.head()

   0  1      2
0  1  1  17234
1  2  2  18077
2  1  2  29265
3  3  2  19224
4  1  3  23768

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [4]:
df.rename(columns={0:'bedrs',1:'bathrs',2:'price_sqr_meter'},inplace=True)           ##rename()
df.head()

   bedrs  bathrs  price_sqr_meter
0      1       1            17234
1      2       2            18077
2      1       2            29265
3      3       2            19224
4      1       3            23768

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [5]:
bigcolumn=pd.concat([s1,s2,s3]).to_frame()  
##to_frame():Series转化为DataFrame
bigcolumn

        0
0       1
1       2
2       1
3       3
4       1
..    ...
95  12358
96  10667
97  27851
98  19245
99  29785

[300 rows x 1 columns]

### Step 6. Ops it seems it is going only until index 99. Is it true?

In [6]:
len(bigcolumn)  #因此是重复了三次0-99

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [8]:
bigcolumn.reset_index(drop=True,inplace=True)
##reset_index():重置索引；
##在获得新的index，原来的index变成数据列，不保留原来的index可以使用参数drop=True，默认False；inplace=True ：是指重置索引的结果是否作用在前面的数据上
bigcolumn

         0
0        1
1        2
2        1
3        3
4        1
..     ...
295  12358
296  10667
297  27851
298  19245
299  29785

[300 rows x 1 columns]